uat_chat/AccumulationRegisters/уатЗаказыНаТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>уатЗаказыНаТС</Name>
			<Comment>(уат)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПараметрВыработки</Name>
					<Comment>Количество параметр выработки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказчик</Name>
					<Comment>Заказчик</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказНаТС</Name>
					<Comment>Заказ на ТС</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Comment>Дата выполнения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПараметрВыработки</Name>
					<Comment>Параметр выработки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

uat_chat/Enums/уатТипыТочекМаршрута.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>уатТипыТочекМаршрута</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Погрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПромежуточныйПункт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разгрузка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

uat_chat/Documents/уатМаршрутныйЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>уатМаршрутныйЛист</Name>
			<Comment>(уат)</Comment>
			<BasedOn>
				<xr:Item>Document.уатЗаказГрузоотправителя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.уатЗаказыГрузоотправителей</xr:Item>
				<xr:Item>AccumulationRegister.уатЗаказыНаТС</xr:Item>
				<xr:Item>AccumulationRegister.уатОборотыПоМаршрутномуЛисту</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИВремяВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОтправления</Name>
					<Comment>Адрес выезда для ТС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресНазначения</Name>
					<Comment>Адрес назначения для ТС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СформированАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИВремяОтправленияПлан</Name>
					<Comment>Плановое время отправления</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыОперацийМаршрутныйЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель1</Name>
					<Comment>Водитель 1</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель2</Name>
					<Comment>Водитель 2</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник1</Name>
					<Comment>Сотрудник 1</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник2</Name>
					<Comment>Сотрудник 2</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесБрутто</Name>
					<Comment>Вес брутто, кг</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Comment>Объем перевезенного груза</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМест</Name>
					<Comment>Общее количество мест</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расстояние</Name>
					<Comment>Протяженность маршрута, км</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВПути</Name>
					<Comment>Время в пути по маршрутному листу</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заказы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пункт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказГрузоотправителя</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Перевозимый груз</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмеренияПоЗаказу</Name>
							<Comment>Единица измерения по заказу на ТС</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрВыработки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПараметрВыработки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипТочкиМаршрута</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уатТипыТочекМаршрута</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоянка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расстояние</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Время</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрибытиеФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УбытиеФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыполнения</Name>
							<Comment>удалить</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесБрутто</Name>
							<Comment>Вес груза в кг</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Comment>Объем груза в м3</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоМест</Name>
							<Comment>Количество мест</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выполнен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрибытиеПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

uat_chat/AccumulationRegisters/уатЗаказыНаТС/Ext/RecordSetModule.bsl
Перем мПериод          Экспорт; // Период движений
Перем мТаблицаДвижений Экспорт; // Таблица движений

Перем МетаданныеДокумента, МетаданныеТабЧасти, ИмяДокумента, ИмяТабличнойЧасти, ИмяТаблицы, СтруктураШапкиДокумента, Отказ, Заголовок; 


// Выполняет приход по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьПриход() Экспорт

	уатОбщегоНазначенияТиповые.уатВыполнитьДвижениеПоРегистру(ЭтотОбъект, ВидДвиженияНакопления.Приход);

КонецПроцедуры // ВыполнитьПриход()

// Выполняет расход по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьРасход() Экспорт

	уатОбщегоНазначенияТиповые.уатВыполнитьДвижениеПоРегистру(ЭтотОбъект, ВидДвиженияНакопления.Расход);

КонецПроцедуры // ВыполнитьРасход()

// Выполняет движения по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьДвижения() Экспорт

	Загрузить(мТаблицаДвижений);

КонецПроцедуры // ВыполнитьДвижения()

// Процедура контролирует остаток по данному регистру по переданному документу
// и его табличной части. В случае недостатка товаров выставляется флаг отказа и 
// выдается сообщение.
//
// Параметры:
//  ДокументОбъект - объект проводимого документа, 
//  Параметры      - структура, содержащая значения параметров необходимых для контроля остатков
//  Отказ          - флаг отказа в проведении,
//  Заголовок      - строка, заголовок сообщения об ошибке проведения.
//
Процедура КонтрольОстатков(ДокументОбъект, ИмяТабЧасти, СтруктураШапки, ОтказПроведения, ЗаголовокСообщения) Экспорт
	
	Если ИмяТабЧасти <> "" Тогда  
		Если ДокументОбъект[ИмяТабЧасти].Количество()=0 Тогда //если в таб.части ничего нет - не надо проверять
			Возврат;
		КонецЕсли;
	КонецЕсли;

	ИмяТабличнойЧасти 		= ИмяТабЧасти;
	Отказ 					= ОтказПроведения;
   	СтруктураШапкиДокумента = СтруктураШапки;
	Заголовок 				= ЗаголовокСообщения;


	МетаданныеДокумента = ДокументОбъект.Метаданные();
	ИмяДокумента        = МетаданныеДокумента.Имя;

	Если ИмяТабЧасти <>"" Тогда
		ИмяТаблицы = ИмяДокумента + "." + СокрЛП(ИмяТабличнойЧасти);
	Иначе
		ИмяТаблицы = ИмяДокумента;
	КонецЕсли;

	Если ИмяТабЧасти <>"" Тогда
		МетаданныеТабЧасти       = МетаданныеДокумента.ТабличныеЧасти[ИмяТабЧасти];
	КонецЕсли;

	Если ИмяДокумента = "уатМаршрутныйЛист" Тогда
		КонтрольОстатков_МаршрутныйЛист(ДокументОбъект);
	Иначе
		Сообщить("Для документа "+ДокументОбъект+" не предусмотрен вызов процедуры 'Контроль остатков' модуля регистра 'Заказы на ТС'");
	КонецЕсли;
	
	ОтказПроведения = Отказ;
    ЗаголовокСообщения = Заголовок;

КонецПроцедуры // КонтрольОстатков()

Процедура КонтрольОстатков_МаршрутныйЛист(ДокументОбъект)

	ЕстьСпрЕдИзм = (Метаданные.Справочники.Найти("ЕдиницыИзмерения") <> Неопределено);
	Если ЕстьСпрЕдИзм тогда
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	МаршрутныйЛист.ЗаказГрузоотправителя								КАК ЗаказНаТС,
		|	МаршрутныйЛист.Номенклатура 							КАК Номенклатура,
		|	МаршрутныйЛист.КоличествоВЕдиницеХраненияОстатков 		КАК КоличествоДокументЕдХрОстатков,   	//количество по документу в единице измерения остатков
		|	МаршрутныйЛист.Количество 								КАК КоличествоДокумент, 				//количество в единице измерения документа
		|	МаршрутныйЛист.ЕдиницаИзмерения							КАК ЕдиницаИзмеренияДокумент,
		|	ЕстьNULL(уатЗаказыНаТСОстатки.КоличествоОстаток, 0)		КАК КоличествоОстатокЗаказ,			// остаток по заказу в единице хранения остатков  
		|	ЕстьNULL(уатЗаказыНаТСОстатки.ЕдиницаИзмерения, МаршрутныйЛист.ЕдиницаИзмеренияПоЗаказу) КАК ЕдиницаИзмеренияЗаказ
		|ИЗ
		|	(ВЫБРАТЬ
		|		уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя 				 КАК ЗаказГрузоотправителя,
		|		уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя.КрайнийСрокОтработки КАК ДатаВыполнения,
		|		уатМаршрутныйЛистЗаказы.Номенклатура 		 КАК Номенклатура,
		|		СУММА(уатМаршрутныйЛистЗаказы.Количество) 	 КАК Количество,         
		|		уатМаршрутныйЛистЗаказы.ЕдиницаИзмерения 	 КАК ЕдиницаИзмерения,
		|		СУММА(ВЫРАЗИТЬ(уатМаршрутныйЛистЗаказы.Количество * уатМаршрутныйЛистЗаказы.ЕдиницаИзмерения.Коэффициент / уатМаршрутныйЛистЗаказы.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК Число(15,3))) КАК КоличествоВЕдиницеХраненияОстатков,
		|		уатМаршрутныйЛистЗаказы.ЕдиницаИзмеренияПоЗаказу КАК ЕдиницаИзмеренияПоЗаказу
		|	ИЗ
		|		Документ.уатМаршрутныйЛист.Заказы КАК уатМаршрутныйЛистЗаказы
		|	ГДЕ
		|		уатМаршрутныйЛистЗаказы.Ссылка = &СсылкаМаршрутныйЛист
		|		И уатМаршрутныйЛистЗаказы.ТипТочкиМаршрута = &ТипТочкиМаршрутаРазгрузка
		|	
		|	СГРУППИРОВАТЬ ПО
		|		уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя,
		|		уатМаршрутныйЛистЗаказы.Номенклатура,
		|		уатМаршрутныйЛистЗаказы.ЕдиницаИзмерения,
		|		уатМаршрутныйЛистЗаказы.ДатаВыполнения,
		|		уатМаршрутныйЛистЗаказы.ЕдиницаИзмеренияПоЗаказу
		|   ) КАК МаршрутныйЛист
		|		
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уатЗаказыНаТС.Остатки(&Момент, ) КАК уатЗаказыНаТСОстатки
		|		ПО МаршрутныйЛист.ЗаказГрузоотправителя.Контрагент = уатЗаказыНаТСОстатки.Заказчик
		|			И МаршрутныйЛист.ЗаказГрузоотправителя = уатЗаказыНаТСОстатки.ЗаказНаТС
		|			И МаршрутныйЛист.Номенклатура = уатЗаказыНаТСОстатки.Номенклатура
		|			И МаршрутныйЛист.ЕдиницаИзмеренияПоЗаказу = уатЗаказыНаТСОстатки.ЕдиницаИзмерения
		|			И МаршрутныйЛист.ЗаказГрузоотправителя.КрайнийСрокОтработки = уатЗаказыНаТСОстатки.ДатаВыполнения";
	Иначе  //для случая УАТ+БП
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	МаршрутныйЛист.ЗаказНаТС								КАК ЗаказНаТС,
		|	МаршрутныйЛист.Номенклатура 							КАК Номенклатура,
		|	МаршрутныйЛист.КоличествоВЕдиницеХраненияОстатков 		КАК КоличествоДокументЕдХрОстатков,   	//количество по документу в единице измерения остатков
		|	МаршрутныйЛист.Количество 								КАК КоличествоДокумент, 				//количество в единице измерения документа
		|	МаршрутныйЛист.ЕдиницаИзмерения							КАК ЕдиницаИзмеренияДокумент,
		|	ЕстьNULL(уатЗаказыНаТСОстатки.КоличествоОстаток,0)		КАК КоличествоОстатокЗаказ,			// остаток по заказу в единице хранения остатков  
		|	ЕстьNULL(уатЗаказыНаТСОстатки.ЕдиницаИзмерения, МаршрутныйЛист.ЕдиницаИзмеренияПоЗаказу) КАК ЕдиницаИзмеренияЗаказ
		|ИЗ
		|	(ВЫБРАТЬ
		|		уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя 				КАК ЗаказНаТС,
		|		уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя.КрайнийСрокОтработки КАК ДатаВыполнения,
		|		уатМаршрутныйЛистЗаказы.Номенклатура 		КАК Номенклатура,
		|		СУММА(уатМаршрутныйЛистЗаказы.Количество) 	КАК Количество,         
		|		уатМаршрутныйЛистЗаказы.ЕдиницаИзмерения 	КАК ЕдиницаИзмерения,
		|		СУММА(уатМаршрутныйЛистЗаказы.Количество)   КАК КоличествоВЕдиницеХраненияОстатков,

		|		уатМаршрутныйЛистЗаказы.ЕдиницаИзмеренияПоЗаказу КАК ЕдиницаИзмеренияПоЗаказу
		|	ИЗ
		|		Документ.уатМаршрутныйЛист.Заказы КАК уатМаршрутныйЛистЗаказы
		|	ГДЕ
		|		уатМаршрутныйЛистЗаказы.Ссылка = &СсылкаМаршрутныйЛист
		|		И уатМаршрутныйЛистЗаказы.ТипТочкиМаршрута = &ТипТочкиМаршрутаРазгрузка
		|	
		|	СГРУППИРОВАТЬ ПО
		|		уатМаршрутныйЛистЗаказы.ЗаказГрузоотправителя,
		|		уатМаршрутныйЛистЗаказы.Номенклатура,
		|		уатМаршрутныйЛистЗаказы.ЕдиницаИзмерения,
		|		уатМаршрутныйЛистЗаказы.ДатаВыполнения,
		|		уатМаршрутныйЛистЗаказы.ЕдиницаИзмеренияПоЗаказу
		|   ) КАК МаршрутныйЛист
		|		
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уатЗаказыНаТС.Остатки(&Момент, ) КАК уатЗаказыНаТСОстатки
		|		ПО МаршрутныйЛист.ЗаказНаТС.Контрагент = уатЗаказыНаТСОстатки.Заказчик
		|			И МаршрутныйЛист.ЗаказНаТС = уатЗаказыНаТСОстатки.ЗаказНаТС
		|			И МаршрутныйЛист.Номенклатура = уатЗаказыНаТСОстатки.Номенклатура
		|			И МаршрутныйЛист.ЕдиницаИзмеренияПоЗаказу = уатЗаказыНаТСОстатки.ЕдиницаИзмерения
		|			И МаршрутныйЛист.ЗаказНаТС.КрайнийСрокОтработки = уатЗаказыНаТСОстатки.ДатаВыполнения";
	КонецЕсли;
				   
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	ЗАпрос.УстановитьПараметр("Момент",						ДокументОбъект.МоментВремени());
	Запрос.УстановитьПараметр("СсылкаМаршрутныйЛист",		ДокументОбъект.Ссылка);
	Запрос.УстановитьПараметр("ТипТочкиМаршрутаРазгрузка",  Перечисления.уатТипыТочекМаршрута.Разгрузка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтрокаСообщения = "";
	мЕстьСпрЕдИзмерения = уатРаботаСМетаданными.естьСпрЕдиницыИзмерения();
	Пока Выборка.Следующий() цикл
		Если Выборка.ТипЗаписи() = ТипЗаписиЗапроса.ИтогПоГруппировке Тогда
			Продолжить;
		КонецЕсли;
		Если Выборка.КоличествоОстатокЗаказ < Выборка.КоличествоДокумент тогда
			КоличествоПревышение = Выборка.КоличествоДокумент - Выборка.КоличествоОстатокЗаказ;  //превышение в единице хранения остатков
			СтрокаСообщения = "" + Символы.Таб + "Превышение списываемого количества для: '" + Выборка.ЗаказНаТС + "' по номенклатуре: '" + Выборка.Номенклатура  + "'."; 
			СтрокаСообщения = СтрокаСообщения + Символы.ПС;
			Если мЕстьСпрЕдИзмерения Тогда
				СтрокаСообщения = СтрокаСообщения + "Превышение: " + КоличествоПревышение
					+ " " + ?(Выборка.ЕдиницаИзмеренияЗаказ = Неопределено, "", Выборка.ЕдиницаИзмеренияЗаказ.Наименование) + "; ";
				СтрокаСообщения = СтрокаСообщения + "Неразвезенный остаток: " + Выборка.КоличествоОстатокЗаказ
					+ " " + ?(Выборка.ЕдиницаИзмеренияЗаказ = Неопределено, "", Выборка.ЕдиницаИзмеренияЗаказ.Наименование) + "; ";
				СтрокаСообщения = СтрокаСообщения + "Количество по документу: " + Выборка.КоличествоДокумент + " " + Выборка.ЕдиницаИзмеренияДокумент
					+ " (" + Выборка.КоличествоДокумент
					+ " " + ?(Выборка.ЕдиницаИзмеренияЗаказ = Неопределено, "", Выборка.ЕдиницаИзмеренияЗаказ.Наименование) + ").";
			Иначе
				СтрокаСообщения = СтрокаСообщения + "Превышение: "+ Выборка.КоличествоДокумент + " " + Выборка.ЕдиницаИзмеренияДокумент + " ";
				СтрокаСообщения = СтрокаСообщения + "Неразвезенный остаток: " 	+ Выборка.КоличествоОстатокЗаказ+ " ";
				СтрокаСообщения = СтрокаСообщения + "Количество по документу: " + Выборка.КоличествоДокумент + " " + Выборка.ЕдиницаИзмеренияДокумент+ " ";
			КонецЕсли;
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаСообщения, Отказ, Заголовок);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
